/**
 * Created by sk2rldnr on 2017-07-18.
 */
angular.module('adminApp').controller('SearchCtrl', SearchCtrl);

function SearchCtrl($scope) {
    var secondDepthCategory = {
        '전체' : ["전체"],
        '여성패션' : ["전체", "여성소호", "상의", "하의", "신발", "가방·패션소품", "아우터", "원피스", "트레이닝", "언더웨어", "빅사이즈", "시즌·테마웨어", "시계·쥬얼리", "꿀딜"],
        '남성·유니섹스패션' : ["전체", "남성소호", "신발", "가방·패션소품", "아우터", "상의", "하의", "정장", "빅사이즈", "트레이닝", "언더웨어", "시즌·테마웨어", "시계·쥬얼리", "꿀딜"],
        '여성브랜드패션' : ["전체", "명품관", "해외의류", "여성·영캐주얼의류", "유니섹스의류", "언더웨어", "신발", "가방·패션잡화", "시계·쥬얼리", "아이웨어", "꿀딜"],
        '남성브랜드패션' : ["전체", "명품관", "해외의류", "정장·캐주얼의류", "유니섹스의류", "언더웨어", "신발", "가방·패션잡화", "시계·쥬얼리", "아이웨어", "꿀딜"],
        '스포츠패션' : ["전체", "의류", "신발", "잡화", "꿀딜", "브랜드관"],
        '뷰티' : ["전체", "스킨케어", "클렌징·팩·마스크", "메이크업·선케어", "바디케어", "헤어케어", "향수", "남성화장품", "트렌드관", "이미용기기·소품", "네일케어", "꿀딜", "브랜드관"],
        '식품·건강' : ["전체", "과일·채소·쌀", "수산·정육·계란", "즉석·가공식품", "김치·반찬·장류", "스낵", "음료", "건강·홍삼", "다이어트", "수입식품", "해외배송", "꿀딜"],
        '출산·유아동' : ["전체", "기저귀", "물티슈", "유아동식품", "유아동의류", "유아동잡화", "교구·교재", "완구", "수유·이유용품", "목욕·위생·스킨케어", "가구·침구", "유모차·외출용품", "임신·출산용품", "꿀딜"],
        '생활·주방' : ["전체", "주방용품·식기", "세제·세안·제지", "수납·정리", "청소용품", "세탁·욕실용품", "가정생활잡화", "건강·의료기기", "해외배송", "꿀딜"],
        '가구·홈·데코' : ["전체", "침실가구", "거실·수납가구", "주방가구", "서재·사무용가구", "아동·학생가구", "침구·커튼·카페트", "홈·인테리어소품", "시공·DIY·조경", "프리미엄식기", "캔들·디퓨저", "꿀딜"],
        '반려동물' : ["전체", "강아지용품", "고양이용품", "관상어·소동물", "스위티 펫샵", "[비즈몰]대량구매관"],
        '가전·디지털' : ["전체", "TV·냉장고·세탁기", "계절가전", "생활·이미용가전", "주방가전", "건강가전", "차량용디지털기기", "노트북·태블릿·PC", "저장장치·주변기기", "모니터·프린터", "모바일·액세서리", "카메라·영상·음향", "렌탈·할부·가입", "꿀딜", "게임·소프트웨어"],
        '레포츠·자동차' : ["전체", "등산·캠핑·낚시", "자전거·헬스", "골프", "스키·보드·수영", "구기·기타스포츠", "차량용품·전자기기", "차량 O2O서비스", "꿀딜"],
        '도서·교육·문구·취미·E쿠폰' : ["전체", "도서", "음반·DVD", "온라인교육", "문구·사무용품", "디자인·취미", "기프트샵", "E쿠폰", "꿀딜"],
        '국내·제주·숙박·입장권' : ["전체", "국내항공권", "국내호텔", "리조트", "펜션", "캠핑·글램핑", "골프·레포츠·체험", "내륙여행", "제주여행", "테마파크·워터파크", "렌터카", "전세계호텔추천"],
        '해외여행·입장권·패스' : ["전체", "해외항공권", "일본", "중국", "동남아", "괌·사이판·호주", "미주·하와이·중남미", "유럽", "입장권·패스", "허니문", "지방출발", "긴급모객", "해외호텔", "홍콩·대만·싱가포르", "해외패키지"],
        '공연·전시·체험·게임' : ["전체", "뮤지컬", "연극·영화", "콘서트·클래식", "전시·박람회", "아동·가족극", "체험·키즈파크", "게임", "대학로"],
        '지역할인쿠폰' : ["전체", "서울", "경기", "인천", "대전", "충청", "강원", "부산", "울산", "대구", "경상", "전라", "제주", "전국포커스"],
        '슈퍼마트' : ["전체", "BEST", "저번에 산 거", "과일·채소·두부", "수산·축산·계란", "쌀·잡곡", "유제품·냉장·냉동·간편식", "베이커리·디저트·잼", "생수·음료·커피", "라면·캔·통조림", "오일·소스·조미료·장류", "스낵·견과", "건강·다이어트", "수입식품", "생활용품", "출산·유아동", "대용량관"],
        '웨어웨어' : ["전체", "여성 의류/신발", "남성 의류/신발", "생활", "가방/주얼리/잡화"],
        '여행홈(모바일에만 사용)' : ["전체"],
        '티몬직구' : ["전체", "남성", "여성", "유아동"],
        '롯데백화점' : ["전체", "여성패션", "남성패션", "언더웨어", "유니섹스", "슈즈·잡화·명품", "주얼리·시계·ACC", "스포츠 패션·슈즈", "등산·골프·수영", "뷰티", "유아·아동", "가구·생활", "식품"],
        '[비즈몰]공통상품' : ["전체", "사무용품", "식음료", "생활용품", "가전디지털", "기념·선물"],
        '[비즈몰]업종별상품' : ["전체", "숙박", "요식", "키즈시설", "애견카페·동물병원"],
        '[비즈몰]업무지원' : ["전체", "서비스상품", "금융상품"],
        '실시간항공·호텔' : ["전체"],
        '[비즈몰]회식' : ["전체", "수도권"],
        '[비즈몰]워크샵' : ["전체", "기타지역"],
        '[비즈몰]뷰티·웨어' : ["전체", "뷰티", "웨어"]
    };

    $scope.firstDepthCategory = ["전체", "여성패션", "남성·유니섹스패션", "여성브랜드패션", "남성브랜드패션", "스포츠패션", "뷰티", "식품·건강", "출산·유아동", "생활·주방", "가구·홈·데코", "반려동물", "가전·디지털", "레포츠·자동차", "도서·교육·문구·취미·E쿠폰", "국내·제주·숙박·입장권", "해외여행·입장권·패스", "공연·전시·체험·게임", "지역할인쿠폰", "슈퍼마트", "웨어웨어", "여행홈(모바일에만 사용)", "티몬직구", "롯데백화점", "[비즈몰]공통상품", "[비즈몰]업종별상품", "[비즈몰]업무지원", "실시간항공·호텔", "[비즈몰]회식", "[비즈몰]워크샵", "[비즈몰]뷰티·웨어"];
    $scope.selected1DepthCategory = $scope.firstDepthCategory[0];
    $scope.selected2DepthCategory = $scope.firstDepthCategory[0];

    $scope.propertyName = "catNo";
    $scope.reverse = false;

    $scope.sortBy = function(propertyName) {
        $scope.reverse = ($scope.propertyName === propertyName) ? !$scope.reverse : false;
        $scope.propertyName = propertyName;
    };

    $scope.onFirstDepthChanged = function() {
        $scope.secondDepthCategory = secondDepthCategory[$scope.selected1DepthCategory];
        $scope.selected2DepthCategory = secondDepthCategory[$scope.selected1DepthCategory][0];
        $scope.currentPage = 0;
    };

    $scope.synonym = function(row) {
        return !!(row.sameWords.indexOf($scope.synonymFilter || '') !== -1 || row.similarWords.indexOf($scope.synonymFilter || '') !== -1);
    };

    $scope.availability = function(row) {
        if ($scope.availabilityFilter === "all") {
            return true;
        } else if ($scope.availabilityFilter === "true") {
            return (row.availability === true);
        } else if ($scope.availabilityFilter === "false")
            return (row.availability === false);
    }

    $scope.firstDepth = function(row) {
        return $scope.selected1DepthCategory === "전체" ? true : row.firstCatName === $scope.selected1DepthCategory;
    }

    $scope.secondDepth = function(row) {
        return $scope.selected2DepthCategory === "전체" ? true : row.secondCatName === $scope.selected2DepthCategory;
    }

    $scope.onSearched = function() {
        $scope.currentPage = 0;
    }
}
